# Creating Database in MySQL :

### Syntax :

In [1]:
# CREATE DATABASE database_name;

### Example :

In [6]:
# CREATE DATABASE student_db;

## Viewing All Databases :

In [7]:
# SHOW DATABASES ;

## Switching to a Database :

In [8]:
# USE student_db;

## Dropping a Database :

In [9]:
# DROP DATABASE database_name:

### Example :

In [10]:
# DROP DATABASE student_db;

# Creating Table in MySQL :

### Syntax :

In [14]:
 #    CREATE TABLE table_name(
 #      column1 datatype constraints,
 #       column2 datatype constraints;
 #    );

### View All Tables :

In [11]:
# SHOW TABLES;

### View Table Structure :

In [12]:
# DESCRIBE table_name;

### Viewing Table Data :

In [13]:
# SELECT * FROM table_name;

# Modifying a Table in MySQL :

## Renaming a Table :

In [15]:
# RENAME TABLE old_table_name TO new_table_name;

### Dropping a Table :

In [16]:
# DROP TABLE table_name;

### Renaming a Column :

In [17]:
# ALTER TABLE table_name RENAME COLUMN old_column_name TO new_column_name;

### Dropping a Column :

In [18]:
# ALTER TABLE table_name DROP COLUMN column_name;

### Adding a Column :

In [19]:
# ALTER TABLE table_name ADD COLUMN column_name datatype constraints;

#### Example :

In [21]:
# ALTER TABLE students ADD COLUMN gender VARCHAR(10);

### Modifying a Column :

In [22]:
# ALTER TABLE table_name MODIFY COLUMN column_name new_datatype new_constraints;

#### Example :

In [23]:
# ALTER TABLE students MODIFY COLUMN name VARCHAR(150) NOT NULL;

### Changing the Order of Columns :

In [24]:
# ATER TABLE table_name MODIFY COLUMN column_name datatype AFTER another_column_name;

# How To Insert Rows into a Table in MySQL :

### Create a New Database :

In [25]:
# CREATE DATABASE database_name;

### Select a Database :

In [26]:
# USE database_name;

### Create the student Table

In [27]:
 #    CREATE TABLE table_name(
 #      column1 datatype constraints,
 #       column2 datatype constraints;
 #    );

### Insert Data into the Table :

### Insert One Row at a Time :

In [30]:
# INSERT INTO student (id, name, age, grade, date_of_birth) VALUES (1, 'Ayesha Khan', 16, '10th', '2007-05-15');
# INSERT INTO student (id, name, age, grade, date_of_birth) VALUES (2, 'Ravi Sharma', 17, '11th', '2006-03-22');
# INSERT INTO student (id, name, age, grade, date_of_birth) VALUES (3, 'Meena Joshi', 15, '9th', NULL);
# INSERT INTO student (id, name, age, grade, date_of_birth) VALUES (4, 'Arjun Verma', 18, '12th', NULL);
# INSERT INTO student (id, name, age, grade, date_of_birth) VALUES (5, 'Sara Ali', 16, '10th', NULL);
# INSERT INTO student (id, name, age, grade, date_of_birth) VALUES (6, 'Karan Mehta', 17, '11th', NULL);

### Insert All Raws at Once :

In [31]:
# INSERT INTO student (id, name, age, grade) VALUES
# (15, 'Ayesha Khan', 16, '10th'),
# (25, 'Ravi Sharma', 17, '11th'),
# (35, 'Meena Joshi', 15, '9th'),
# (45, 'Arjun Verma', 18, '12th'),
# (55, 'Sara Ali', 16, '10th'),
# (65, 'Karan Mehta', 17, '11th')